{
    "about": {
        "name": "Micah Kim",
        "title": "Student @ Boston College",
        "address": "118 Walsh Hall, Chestnut Hill, MA 02467",
        "photo": "assets/portrait.jpg",
        "email": "micah.kim@bc.edu",
        "social":{
            "resume": "https://drive.google.com/file/d/17t0rSJHaZQBFgoqlzQa_pxOJKemw-E-7/view?usp=sharing",
            "twitter": "https://twitter.com/sldkjfsd",
            "linkedin": "https://www.linkedin.com/in/mkim-0/",
            "github": "https://github.com/micah-kim"
        },
        "description": [
            "Micah Kim is a student at Boston College studying Computer Science and Mathematics. As an Undergraduate Researcher and Computer Science Teaching Assistant, he aspires to <strong> promote educational opportunities and resources in the study and applications of technology</strong>.",
            "In Micah's research under Professor Joseph Nugent, he utilizes his skills in <strong>augmented reality</strong> technology and <strong>iOS development</strong> to create immersive applications that engineer solutions to improve daily life.",
            "As a Teaching Assistant for the <strong>Data Structures and Algorithms course (CSCI1102)</strong> , Micah holds weekly office hours to collaborate with students in helping them with problem sets and in understanding difficult concepts throughout the course. He also leads an <strong>hour-long discussion section</strong> every week to encourage students to work with one another and go more in-depth with the course material through more challenging problems.",
            "Most recently, Micah has joined another research team under Professor Bryan Ranger in the Engineering Department to create a mobile application for portable ultrasound systems."
        ]
    },
    "news": [
        {
            "title": "Computer Science Teaching Assistant",
            "date": "Jan 17, 2022"
        },
        {
            "title": "Started Spring 2022 semester",
            "date": "Jan 17, 2022"
        },
        {
            "title": "Traveled to Korea",
            "date": "Dec 16, 2021"
        },
        {
            "title": "Undergraduate Research",
            "date": "Jun 1, 2021"
        }
    ],
    "projects": [
        {
            "images": [
                "assets/project1_img1.jpeg",
                "assets/project1_img2.png"
            ],
            "id": 0,
            "title": "The Third Policeman Treasure Hunt: Augmented Reality Escape Room Game",
            "contributors": "Micah Kim, Joseph Nugent, Liam Weir, Sean Chiang, Sarah Kim, Christine Lenahan, Joshua Yi, Aaron Yi, Peter Zogby",
            "event": "International Annual Flann O'brien Conference 2022",
            "type": [
                "Research"
            ],
            "typecolor": "project-type-research",
            "date": "06-01-2021 ~ Present",
            "links": {
                "presentation": "https://docs.google.com/document/d/13ckSHtF2Syydq1p6dMBc763XlmELjZ_IlojJ-hkLnxM/edit?usp=sharing",
                "code": "https://github.com/UlyssesAR"
            },
            "description": "Flann O'brien's novel <i>The Third Policeman</i>, published in 1939, is a dark comic novel exploring the nature of death, time, and existance. It is very impactful piece of Irish Literature is very well-known throughout the world. In this project, I worked with a team of students interested in Computer Science, English, and Film to recreate scenes from the novel in Augmented Reality. By Using the Swift programming language, optimizing the ARKit framework, creating 3D models using Cinema 4D, and animating them using Reality Composer. This project will be presented at the International Flann O'Brien Conference in April, 2022."
        },
        {
            "images": [
                "assets/project2_img1.png",
                "assets/project2_img2.jpg"
            ],
            "id": 1,
            "title": "Recycle It: Using Machine Learning to Identify Recyclable Items",
            "contributors": "Micah Kim, Benjamin Lee, Andrew Choi",
            "event": "Boston College Hack the Heights Hackathon 2021",
            "type": [
                "Hackathon"
            ],
            "typecolor": "project-type-hackathon",
            "date": "11-10-2021 ~ 11-11-2021",
            "links": {
                "event": "https://hacktheheights.org/",
                "presentation": "https://docs.google.com/presentation/d/1bzumaK3qnwNJbYTFr-iFHRLluCd1bINTC_LIbQwQqoU/edit?usp=sharing",
                "code": "https://github.com/micah-kim/Recycle-It"
            },
            "description": "This project was completed for Boston College's 2021 Hack the Heights hackathon. By training our own machine learning model, my team and I engineered an iOS application  that can detect different types of recyclable materials through the camera. I was primarily in charge of coding the Swift application and my teammates took charge in coding the UI and creating a presentation of our work. We used Swift, Apple's ML Model, Xcode, and ARKit for our project and ended up winning a placement in the competition."
        },
        {
            "images": [
                "assets/project3_img1.png",
                "assets/project3_img2.png"
            ],
            "id": 2,
            "title": "Augmented Museum App: A New Way to Visualize Art",
            "contributors": "Micah Kim",
            "event": "Personal Project",
            "type": [
                "Personal"
            ],
            "typecolor": "project-type-personal",
            "date": "07-15-2021 ~ 08-15-2021",
            "links": {
                "paper": "https://drive.google.com/file/d/1XyV726CWuPdE8ezMRcSFPqzZWC4LWXd3/view?usp=sharing",
                "code": "https://github.com/micah-kim/Augmented-Museum-App"
            },
            "description": "I've always loved art but I was never a fan of those plaques that have the art's description. It ruin's the museum's neat asthetic and  isn't good for the environment. By optimizing ARkit's image recognition software, I created an application that anchor's virtual text when detecting an artword through the phone's camera."
        }
    ]
}